<center><h2>Predicate: <font color=red><i>&#1581;&#1589;&#1604;</i></font></h2></center>

<h4>Roleset id: <font color=green>&#1581;&#1589;&#1604;.01</font>, receive, get <font color=purple>Source: </font>[receive.01]</h4>

<h4>Roles:</h4>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>A0</b>: <i>receiver</i><br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>A1</b>: <i>thing gotten</i><br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>A2</b>: <i>received from</i><br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>A3</b>: <i>price, in exchange for</i><br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>A4</b>: <i>attribute of arg1</i><br>
<h4>Example: </h4>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <font size=2> &#1608; &#1575;&#1604;&#1605;&#1585;&#1571;&#1577; &#1575;&#1604;&#1578;&#1610; &#1578;&#1581;&#1578;&#1575;&#1580; &#1573;&#1604;&#1609; &#1585;&#1593;&#1575;&#1610;&#1577; &#1605;&#1578;&#1582;&#1589;&#1589;&#1577; &#1578;&#1581;&#1589;&#1604; &#1593;&#1604;&#1610;&#1607;&#1575; &#1605;&#1580;&#1575;&#1606;&#1575; &#1605;&#1606; &#1582;&#1604;&#1575;&#1604; &#1582;&#1583;&#1605;&#1575;&#1578; &#1575;&#1604;&#1585;&#1593;&#1575;&#1610;&#1577; &#1575;&#1604;&#1579;&#1575;&#1606;&#1608;&#1610;&#1577; &#1604;&#1604; &#1571;&#1605;&#1608;&#1605;&#1577; .</font><br><br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>A0</b>: &#1575;&#1604;&#1605;&#1585;&#1571;&#1577; &#1575;&#1604;&#1578;&#1610; &#1578;&#1581;&#1578;&#1575;&#1580; &#1573;&#1604;&#1609; &#1585;&#1593;&#1575;&#1610;&#1577; &#1605;&#1578;&#1582;&#1589;&#1589;&#1577;  <br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>Rel</b>: &#1578;&#1581;&#1589;&#1604;<br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>A1</b>: &#1593;&#1604;&#1610;&#1607;&#1575; &#1605;&#1580;&#1575;&#1606;&#1575;  <br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>A2</b>: &#1605;&#1606; &#1582;&#1604;&#1575;&#1604; &#1582;&#1583;&#1605;&#1575;&#1578; &#1575;&#1604;&#1585;&#1593;&#1575;&#1610;&#1577; &#1575;&#1604;&#1579;&#1575;&#1606;&#1608;&#1610;&#1577; &#1604;&#1604; &#1571;&#1605;&#1608;&#1605;&#1577;  <br>
<h4>Example: </h4>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <font size=2> &#1603;&#1605;&#1575; &#1581;&#1589;&#1604;&#1578; &#1605;&#1579;&#1604; &#1607;&#1584;&#1607; &#1575;&#1604;&#1605;&#1576;&#1575;&#1583;&#1585;&#1575;&#1578; &#1593;&#1604;&#1609; &#1575;&#1604;&#1583;&#1593;&#1605; &#1575;&#1604;&#1605;&#1575;&#1604;&#1610; &#1605;&#1606; &#1575;&#1604;&#1607;&#1610;&#1574;&#1575;&#1578; &#1575;&#1604;&#1581;&#1603;&#1608;&#1605;&#1610;&#1577; .</font><br><br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>AM-DIS</b>: &#1603;&#1605;&#1575;  <br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>Rel</b>: &#1581;&#1589;&#1604;&#1578;<br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>A0</b>: &#1605;&#1579;&#1604; &#1607;&#1584;&#1607; &#1575;&#1604;&#1605;&#1576;&#1575;&#1583;&#1585;&#1575;&#1578;  <br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>A1</b>: &#1593;&#1604;&#1609; &#1575;&#1604;&#1583;&#1593;&#1605; &#1575;&#1604;&#1605;&#1575;&#1604;&#1610; &#1605;&#1606; &#1575;&#1604;&#1607;&#1610;&#1574;&#1575;&#1578; &#1575;&#1604;&#1581;&#1603;&#1608;&#1605;&#1610;&#1577;  <br>
<h4>Example: </h4>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <font size=2> &#1608;&#1601;&#1610; &#1581;&#1586;&#1610;&#1585;&#1575;&#1606; / &#1610;&#1608;&#1606;&#1610;&#1607; 2000 , &#1581;&#1589;&#1604; &#1575;&#1604;&#1605;&#1585;&#1603;&#1586; &#1593;&#1604;&#1609; &#1575;&#1604;&#1608;&#1590;&#1593; &#1575;&#1604;&#1602;&#1575;&#1606;&#1608;&#1606;&#1610; &#1604; &#1605;&#1606;&#1592;&#1605;&#1577; &#1594;&#1610;&#1585; &#1581;&#1603;&#1608;&#1605;&#1610;&#1577; .</font><br><br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>AM-TMP</b>: &#1608;&#1601;&#1610; &#1581;&#1586;&#1610;&#1585;&#1575;&#1606; / &#1610;&#1608;&#1606;&#1610;&#1607; 2000  <br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>Rel</b>: &#1581;&#1589;&#1604;<br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>A0</b>: &#1575;&#1604;&#1605;&#1585;&#1603;&#1586;  <br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>A1</b>: &#1593;&#1604;&#1609; &#1575;&#1604;&#1608;&#1590;&#1593; &#1575;&#1604;&#1602;&#1575;&#1606;&#1608;&#1606;&#1610; &#1604; &#1605;&#1606;&#1592;&#1605;&#1577; &#1594;&#1610;&#1585; &#1581;&#1603;&#1608;&#1605;&#1610;&#1577;  <br>
<h4>Example: </h4>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <font size=2> &#1581;&#1589;&#1604; &#1593;&#1604;&#1609; &#1588;&#1607;&#1575;&#1583;&#1577; &#1575;&#1604;&#1583;&#1603;&#1578;&#1608;&#1585;&#1575;&#1607; &#1601;&#1610; &#1593;&#1604;&#1605; &#1575;&#1604;&#1586;&#1585;&#1575;&#1593;&#1577; &#1605;&#1606; &#1580;&#1575;&#1605;&#1593;&#1577; &#1580;&#1608;&#1585;&#1580;&#1610;&#1575; &#1601;&#1610; &#1575;&#1604;&#1608;&#1604;&#1575;&#1610;&#1575;&#1578; &#1575;&#1604;&#1605;&#1578;&#1581;&#1583;&#1577; .</font><br><br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>Rel</b>: &#1581;&#1589;&#1604;<br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>A1</b>: &#1593;&#1604;&#1609; &#1588;&#1607;&#1575;&#1583;&#1577; &#1575;&#1604;&#1583;&#1603;&#1578;&#1608;&#1585;&#1575;&#1607;  <br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>AM-LOC</b>: &#1601;&#1610; &#1593;&#1604;&#1605; &#1575;&#1604;&#1586;&#1585;&#1575;&#1593;&#1577;  <br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>A2</b>: &#1605;&#1606; &#1580;&#1575;&#1605;&#1593;&#1577; &#1580;&#1608;&#1585;&#1580;&#1610;&#1575; &#1601;&#1610; &#1575;&#1604;&#1608;&#1604;&#1575;&#1610;&#1575;&#1578; &#1575;&#1604;&#1605;&#1578;&#1581;&#1583;&#1577;  <br>