<center><h2>Predicate: <font color=red><i>&#1582;&#1578;&#1605;</i></font></h2></center>

<h4>Roleset id: <font color=green>&#1582;&#1578;&#1605;.01</font>, conclude, bring to an end <font color=purple>Source: </font>[conclude.02]</h4>

<h4>Roles:</h4>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>A0</b>: <i>Intentional agent</i><br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>A1</b>: <i>Thing ending</i><br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>A2</b>: <i>Explicit instrument, thing ended with</i><br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>AM</b>: <i>point at which something ends</i><br>
<h4>Example: </h4>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <font size=2> &#1608; &#1607;&#1603;&#1584;&#1575; &#1575;&#1582;&#1578;&#1578;&#1605;&#1578; &#1575;&#1604;&#1580;&#1605;&#1593;&#1610;&#1577; &#1575;&#1604;&#1593;&#1575;&#1605;&#1577; &#1601;&#1610; &#1607;&#1584;&#1607; &#1575;&#1604;&#1605;&#1585;&#1581;&#1604;&#1577; &#1606;&#1592;&#1585;&#1607;&#1575; &#1601;&#1610; &#1575;&#1604;&#1576;&#1606;&#1583; 94 &#1605;&#1606; &#1580;&#1583;&#1608;&#1604; &#1575;&#1604;&#1571;&#1593;&#1605;&#1575;&#1604; .</font><br><br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>AM-DIS</b>: &#1607;&#1603;&#1584;&#1575;  <br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>Rel</b>: &#1575;&#1582;&#1578;&#1578;&#1605;&#1578;<br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>A0</b>: &#1575;&#1604;&#1580;&#1605;&#1593;&#1610;&#1577; &#1575;&#1604;&#1593;&#1575;&#1605;&#1577;  <br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>A1</b>: &#1601;&#1610; &#1607;&#1584;&#1607; &#1575;&#1604;&#1605;&#1585;&#1581;&#1604;&#1577; &#1606;&#1592;&#1585;&#1607;&#1575; &#1601;&#1610; &#1575;&#1604;&#1576;&#1606;&#1583; 94 &#1605;&#1606; &#1580;&#1583;&#1608;&#1604; &#1575;&#1604;&#1571;&#1593;&#1605;&#1575;&#1604;  <br>
<h4>Example: </h4>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <font size=2> &#1608; &#1576;&#1584;&#1604;&#1603; &#1575;&#1582;&#1578;&#1578;&#1605;&#1578; &#1575;&#1604;&#1604;&#1580;&#1606;&#1577; &#1575;&#1604;&#1606;&#1592;&#1585; &#1601;&#1610; &#1575;&#1604;&#1576;&#1606;&#1583; 154 &#1605;&#1606; &#1580;&#1583;&#1608;&#1604; &#1575;&#1604;&#1571;&#1593;&#1605;&#1575;&#1604; .</font><br><br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>AM-DIS</b>: &#1576;&#1584;&#1604;&#1603;  <br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>Rel</b>: &#1575;&#1582;&#1578;&#1578;&#1605;&#1578;<br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>A0</b>: &#1575;&#1604;&#1604;&#1580;&#1606;&#1577;  <br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>A1</b>: &#1575;&#1604;&#1606;&#1592;&#1585; &#1601;&#1610; &#1575;&#1604;&#1576;&#1606;&#1583; 154 &#1605;&#1606; &#1580;&#1583;&#1608;&#1604; &#1575;&#1604;&#1571;&#1593;&#1605;&#1575;&#1604;  <br>
<h4>Example: </h4>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <font size=2> &#1575;&#1582;&#1578;&#1578;&#1605;&#1578; &#1576;&#1604;&#1583;&#1575;&#1606; &#1571;&#1605;&#1585;&#1610;&#1603;&#1575; &#1575;&#1604;&#1608;&#1587;&#1591;&#1609; &#1602;&#1576;&#1604; &#1601;&#1578;&#1585;&#1577; &#1608; &#1580;&#1610;&#1586;&#1577; &#1605;&#1601;&#1575;&#1608;&#1590;&#1575;&#1578; &#1578;&#1580;&#1575;&#1585;&#1610;&#1577; &#1605;&#1593; &#1575;&#1604;&#1608;&#1604;&#1575;&#1610;&#1575;&#1578; &#1575;&#1604;&#1605;&#1578;&#1581;&#1583;&#1577; .</font><br><br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>Rel</b>: &#1575;&#1582;&#1578;&#1578;&#1605;&#1578;<br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>A0</b>: &#1576;&#1604;&#1583;&#1575;&#1606; &#1571;&#1605;&#1585;&#1610;&#1603;&#1575; &#1575;&#1604;&#1608;&#1587;&#1591;&#1609;  <br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>AM-ADV</b>: &#1602;&#1576;&#1604; &#1601;&#1578;&#1585;&#1577; &#1608; &#1580;&#1610;&#1586;&#1577;  <br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>A1</b>: &#1605;&#1601;&#1575;&#1608;&#1590;&#1575;&#1578; &#1578;&#1580;&#1575;&#1585;&#1610;&#1577; &#1605;&#1593; &#1575;&#1604;&#1608;&#1604;&#1575;&#1610;&#1575;&#1578; &#1575;&#1604;&#1605;&#1578;&#1581;&#1583;&#1577;  <br>
<h4>Example: </h4>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <font size=2> &#1604;&#1602;&#1583; &#1575;&#1582;&#1578;&#1578;&#1605;&#1578; &#1578;&#1608;&#1575; &#1602;&#1605;&#1577; &#1575;&#1604;&#1571;&#1604;&#1601;&#1610;&#1577; &#1575;&#1604;&#1578;&#1610; &#1580;&#1584;&#1576;&#1578; &#1575;&#1604;&#1575;&#1606;&#1578;&#1576;&#1575;&#1607; &#1601;&#1610; &#1580;&#1605;&#1610;&#1593; &#1571;&#1585;&#1580;&#1575;&#1569; &#1575;&#1604;&#1593;&#1575;&#1604;&#1605; .</font><br><br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>A0</b>: &#1604;&#1602;&#1583;  <br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>Rel</b>: &#1575;&#1582;&#1578;&#1578;&#1605;&#1578;<br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>R-A0</b>: &#1575;&#1604;&#1578;&#1610; &#1580;&#1584;&#1576;&#1578; &#1575;&#1604;&#1575;&#1606;&#1578;&#1576;&#1575;&#1607; &#1601;&#1610; &#1580;&#1605;&#1610;&#1593; &#1571;&#1585;&#1580;&#1575;&#1569; &#1575;&#1604;&#1593;&#1575;&#1604;&#1605;  <br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>A1</b>: &#1575;&#1604;&#1575;&#1606;&#1578;&#1576;&#1575;&#1607;  <br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>AM-LOC</b>: &#1601;&#1610; &#1580;&#1605;&#1610;&#1593; &#1571;&#1585;&#1580;&#1575;&#1569; &#1575;&#1604;&#1593;&#1575;&#1604;&#1605;  <br>