<center><h2>Predicate: <font color=red><i>&#1588;&#1603;&#1604;</i></font></h2></center>

<h4>Roleset id: <font color=green>&#1588;&#1603;&#1604;.01</font>, form, comprise <font color=purple>Source: </font>[form.02]</h4>

<h4>Roles:</h4>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>A0</b>: <i>components</i><br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>A1</b>: <i>whole</i><br>
<h4>Example: </h4>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <font size=2> &#1608; &#1576;&#1584;&#1604;&#1603; &#1578;&#1588;&#1603;&#1604; &#1607;&#1584;&#1607; &#1575;&#1604;&#1578;&#1602;&#1575;&#1585;&#1610;&#1585; &#1580;&#1586;&#1569;&#1575; &#1605;&#1606; &#1607;&#1610;&#1603;&#1604; &#1575;&#1604;&#1605;&#1585;&#1575;&#1602;&#1576;&#1577; &#1575;&#1604;&#1583;&#1575;&#1582;&#1604;&#1610;&#1577; &#1604;&#1604; &#1589;&#1606;&#1583;&#1608;&#1602; .</font><br><br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>AM-DIS</b>: &#1608; &#1576;&#1584;&#1604;&#1603; .  <br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>Rel</b>: &#1578;&#1588;&#1603;&#1604;<br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>A0</b>: &#1607;&#1584;&#1607; &#1575;&#1604;&#1578;&#1602;&#1575;&#1585;&#1610;&#1585;  <br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>A1</b>: &#1580;&#1586;&#1569;&#1575; &#1605;&#1606; &#1607;&#1610;&#1603;&#1604; &#1575;&#1604;&#1605;&#1585;&#1575;&#1602;&#1576;&#1577; &#1575;&#1604;&#1583;&#1575;&#1582;&#1604;&#1610;&#1577; &#1604;&#1604; &#1589;&#1606;&#1583;&#1608;&#1602;  <br>
<h4>Example: </h4>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <font size=2> &#1608; &#1578;&#1608;&#1580;&#1583; &#1575;&#1604;&#1610;&#1608;&#1605; &#1593;&#1606;&#1575;&#1589;&#1585; &#1603;&#1575;&#1601;&#1610;&#1577; &#1610;&#1605;&#1603;&#1606; &#1571;&#1606; &#1578;&#1588;&#1603;&#1604; &#1575;&#1604;&#1571;&#1587;&#1575;&#1587; &#1604; &#1593;&#1605;&#1604;&#1610;&#1577; &#1575;&#1604;&#1573;&#1589;&#1604;&#1575;&#1581; &#1575;&#1604;&#1588;&#1575;&#1605;&#1604; .</font><br><br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>A0</b>: &#1593;&#1606;&#1575;&#1589;&#1585; &#1603;&#1575;&#1601;&#1610;&#1577; &#1610;&#1605;&#1603;&#1606; &#1571;&#1606;  <br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>AM-MOD</b>: &#1610;&#1605;&#1603;&#1606;  <br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>R-A0</b>: &#1571;&#1606;  <br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>Rel</b>: &#1578;&#1588;&#1603;&#1604;<br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>A1</b>: &#1575;&#1604;&#1571;&#1587;&#1575;&#1587; &#1604; &#1593;&#1605;&#1604;&#1610;&#1577; &#1575;&#1604;&#1573;&#1589;&#1604;&#1575;&#1581; &#1575;&#1604;&#1588;&#1575;&#1605;&#1604;  <br>
<h4>Example: </h4>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <font size=2> &#1576;&#1575;&#1604;&#1606;&#1587;&#1576;&#1577; &#1604;&#1606;&#1575; &#1601;&#1610; &#1571;&#1605;&#1585;&#1610;&#1603;&#1575; &#1575;&#1604;&#1608;&#1587;&#1591;&#1609; &#1608; &#1605;&#1606;&#1591;&#1602;&#1577; &#1575;&#1604;&#1576;&#1581;&#1585; &#1575;&#1604;&#1603;&#1575;&#1585;&#1610;&#1576;&#1610; , &#1610;&#1588;&#1603;&#1604; &#1575;&#1604;&#1571;&#1591;&#1601;&#1575;&#1604; &#1571;&#1603;&#1576;&#1585; &#1588;&#1585;&#1610;&#1581;&#1577; &#1605;&#1606; &#1587;&#1603;&#1575;&#1606;&#1606;&#1575; .</font><br><br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>AM-ADV</b>: &#1576;&#1575;&#1604;&#1606;&#1587;&#1576;&#1577; &#1604;&#1606;&#1575; &#1601;&#1610; &#1571;&#1605;&#1585;&#1610;&#1603;&#1575; &#1575;&#1604;&#1608;&#1587;&#1591;&#1609; &#1608; &#1605;&#1606;&#1591;&#1602;&#1577; &#1575;&#1604;&#1576;&#1581;&#1585; &#1575;&#1604;&#1603;&#1575;&#1585;&#1610;&#1576;&#1610;  <br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>Rel</b>: &#1610;&#1588;&#1603;&#1604;<br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>A0</b>: &#1575;&#1604;&#1571;&#1591;&#1601;&#1575;&#1604; &#1571;&#1603;&#1576;&#1585;  <br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>A1</b>: &#1588;&#1585;&#1610;&#1581;&#1577; &#1605;&#1606; &#1587;&#1603;&#1575;&#1606;&#1606;&#1575;  <br>
<h4>Example: </h4>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <font size=2> &#1608;&#1605;&#1606; &#1588;&#1571;&#1606; &#1578;&#1604;&#1603; &#1575;&#1604;&#1605;&#1576;&#1575;&#1583;&#1574; &#1571;&#1610;&#1590;&#1575; &#1571;&#1606; &#1578;&#1588;&#1603;&#1604; &#1571;&#1587;&#1575;&#1587;&#1575; &#1604; &#1578;&#1608;&#1587;&#1610;&#1593; &#1606;&#1591;&#1575;&#1602; &#1575;&#1604;&#1578;&#1606;&#1605;&#1610;&#1577; &#1575;&#1604;&#1575;&#1580;&#1578;&#1605;&#1575;&#1593;&#1610;&#1577; .</font><br><br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>A0</b>: &#1608;&#1605;&#1606; &#1588;&#1571;&#1606; &#1578;&#1604;&#1603; &#1575;&#1604;&#1605;&#1576;&#1575;&#1583;&#1574; &#1571;&#1610;&#1590;&#1575; &#1571;&#1606; .  <br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>AM-MOD</b>: &#1588;&#1571;&#1606;  <br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>Rel</b>: &#1578;&#1588;&#1603;&#1604;<br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>A1</b>: &#1571;&#1587;&#1575;&#1587;&#1575; &#1604; &#1578;&#1608;&#1587;&#1610;&#1593; &#1606;&#1591;&#1575;&#1602; &#1575;&#1604;&#1578;&#1606;&#1605;&#1610;&#1577; &#1575;&#1604;&#1575;&#1580;&#1578;&#1605;&#1575;&#1593;&#1610;&#1577;  <br>