<center><h2>Predicate: <font color=red><i>&#1591;&#1608;&#1610;</i></font></h2></center>

<h4>Roleset id: <font color=green>&#1591;&#1608;&#1610;.01</font>, involve, include <font color=purple>Source: </font>[involve.01]</h4>

<h4>Roles:</h4>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>A0</b>: <i>causer of inclusion</i><br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>A1</b>: <i>theme, thing being included into a group</i><br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>A2</b>: <i>group</i><br>
<h4>Example: </h4>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <font size=2> &#1608; &#1593;&#1575;&#1583;&#1577; &#1605;&#1575; &#1610;&#1606;&#1591;&#1608;&#1610; &#1607;&#1584;&#1575; &#1593;&#1604;&#1609; &#1578;&#1606;&#1601;&#1610;&#1584; &#1606;&#1601;&#1587; &#1575;&#1604;&#1575;&#1604;&#1578;&#1586;&#1575;&#1605; &#1571;&#1608; &#1575;&#1604;&#1578;&#1586;&#1575;&#1605; &#1608; &#1579;&#1610;&#1602; &#1575;&#1604;&#1589;&#1604;&#1577; &#1576;&#1607; .</font><br><br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>AM-ADV</b>: &#1593;&#1575;&#1583;&#1577; &#1605;&#1575;  <br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>AM-MOD</b>: &#1605;&#1575;  <br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>Rel</b>: &#1610;&#1606;&#1591;&#1608;&#1610;<br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>A2</b>: &#1607;&#1584;&#1575;  <br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>A1</b>: &#1593;&#1604;&#1609; &#1578;&#1606;&#1601;&#1610;&#1584; &#1606;&#1601;&#1587; &#1575;&#1604;&#1575;&#1604;&#1578;&#1586;&#1575;&#1605;  <br>
<h4>Example: </h4>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <font size=2> &#1601;&#1575;&#1604;&#1605;&#1585;&#1581;&#1604;&#1577; &#1575;&#1604;&#1571;&#1608;&#1604;&#1609; &#1602;&#1583; &#1575;&#1606;&#1591;&#1608;&#1578; &#1593;&#1604;&#1609; &#1573;&#1578;&#1605;&#1575;&#1605; &#1608;&#1590;&#1593; &#1578;&#1602;&#1585;&#1610;&#1585; &#1578;&#1582;&#1591;&#1610;&#1591;&#1610; &#1608; &#1571;&#1588;&#1594;&#1575;&#1604; &#1605;&#1578;&#1593;&#1604;&#1602;&#1577; &#1576;&#1576;&#1581;&#1608;&#1579; &#1575;&#1604;&#1605;&#1608;&#1602;&#1593; .</font><br><br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>AM-TMP</b>: &#1601;&#1575;&#1604;&#1605;&#1585;&#1581;&#1604;&#1577; &#1575;&#1604;&#1571;&#1608;&#1604;&#1609; .  <br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>A2</b>: &#1575;&#1604;&#1571;&#1608;&#1604;&#1609;  <br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>AM-MOD</b>: &#1602;&#1583;  <br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>Rel</b>: &#1575;&#1606;&#1591;&#1608;&#1578;<br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>A1</b>: &#1593;&#1604;&#1609; &#1573;&#1578;&#1605;&#1575;&#1605; &#1608;&#1590;&#1593; &#1578;&#1602;&#1585;&#1610;&#1585; &#1578;&#1582;&#1591;&#1610;&#1591;&#1610; &#1608; &#1571;&#1588;&#1594;&#1575;&#1604;  <br>
<h4>Example: </h4>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <font size=2> &#1608; &#1575;&#1604;&#1573;&#1578;&#1580;&#1575;&#1585; &#1576;&#1575;&#1604;&#1571;&#1588;&#1582;&#1575;&#1589; &#1610;&#1606;&#1591;&#1608;&#1610; &#1576;&#1608;&#1580;&#1607; &#1582;&#1575;&#1589; &#1593;&#1604;&#1609; &#1575;&#1606;&#1578;&#1607;&#1575;&#1603;&#1575;&#1578; &#1604; &#1593;&#1583;&#1583; &#1605;&#1606; &#1575;&#1604;&#1575;&#1578;&#1601;&#1575;&#1602;&#1610;&#1575;&#1578; &#1575;&#1604;&#1583;&#1608;&#1604;&#1610;&#1577; .</font><br><br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>A2</b>: &#1575;&#1604;&#1573;&#1578;&#1580;&#1575;&#1585; &#1576;&#1575;&#1604;&#1571;&#1588;&#1582;&#1575;&#1589;  <br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>Rel</b>: &#1610;&#1606;&#1591;&#1608;&#1610;<br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>AM-ADV</b>: &#1576;&#1608;&#1580;&#1607; &#1582;&#1575;&#1589;  <br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>A1</b>: &#1593;&#1604;&#1609; &#1575;&#1606;&#1578;&#1607;&#1575;&#1603;&#1575;&#1578; &#1604; &#1593;&#1583;&#1583; &#1605;&#1606; &#1575;&#1604;&#1575;&#1578;&#1601;&#1575;&#1602;&#1610;&#1575;&#1578; &#1575;&#1604;&#1583;&#1608;&#1604;&#1610;&#1577;  <br>
<h4>Example: </h4>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <font size=2> &#1608;&#1604; &#1608;&#1581;&#1592; &#1571;&#1610;&#1590;&#1575; &#1571;&#1606; &#1593;&#1583;&#1605; &#1575;&#1604;&#1575;&#1610;&#1583;&#1575;&#1593; &#1602;&#1583; &#1610;&#1606;&#1591;&#1608;&#1610; &#1593;&#1604;&#1609; &#1571;&#1593;&#1576;&#1575;&#1569; &#1575;&#1590;&#1575;&#1601;&#1610;&#1577; &#1604; &#1578;&#1608;&#1601;&#1610;&#1585; &#1571;&#1583;&#1604;&#1577; &#1575;&#1604;&#1575;&#1579;&#1576;&#1575;&#1578; .</font><br><br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>A2</b>: &#1593;&#1583;&#1605; &#1575;&#1604;&#1575;&#1610;&#1583;&#1575;&#1593;  <br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>AM-MOD</b>: &#1602;&#1583;  <br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>Rel</b>: &#1610;&#1606;&#1591;&#1608;&#1610;<br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>A1</b>: &#1593;&#1604;&#1609; &#1571;&#1593;&#1576;&#1575;&#1569; &#1575;&#1590;&#1575;&#1601;&#1610;&#1577; &#1604; &#1578;&#1608;&#1601;&#1610;&#1585; &#1571;&#1583;&#1604;&#1577; &#1575;&#1604;&#1575;&#1579;&#1576;&#1575;&#1578;  <br>