<center><h2>Predicate: <font color=red><i>&#1601;&#1590;&#1610;</i></font></h2></center>

<h4>Roleset id: <font color=green>&#1601;&#1590;&#1610;.01</font>, lead, resulted <font color=purple>Source: </font>[lead.03]</h4>

<h4>Roles:</h4>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>A0</b>: <i>factors</i><br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>A1</b>: <i>led entity</i><br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>A2</b>: <i>result, action or attribute on arg1</i><br>
<h4>Example: </h4>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <font size=2> &#1608; &#1610;&#1606;&#1576;&#1594;&#1610; &#1571;&#1606; &#1610;&#1601;&#1590;&#1610; &#1584;&#1604;&#1603; &#1573;&#1604;&#1609; &#1586;&#1610;&#1575;&#1583;&#1577; &#1575;&#1604;&#1581;&#1575;&#1601;&#1586; &#1575;&#1604;&#1601;&#1585;&#1583;&#1610; &#1608; &#1575;&#1604;&#1583;&#1593;&#1605; &#1575;&#1604;&#1605;&#1602;&#1583;&#1605; &#1605;&#1606; &#1589;&#1575;&#1606;&#1593;&#1610; &#1575;&#1604;&#1602;&#1585;&#1575;&#1585;&#1575;&#1578; .</font><br><br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>A0</b>: &#1608;  <br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>AM-MOD</b>: &#1610;&#1606;&#1576;&#1594;&#1610;  <br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>AM-DIS</b>: &#1571;&#1606;  <br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>Rel</b>: &#1610;&#1601;&#1590;&#1610;<br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>A2</b>: &#1573;&#1604;&#1609; &#1586;&#1610;&#1575;&#1583;&#1577; &#1575;&#1604;&#1581;&#1575;&#1601;&#1586; &#1575;&#1604;&#1601;&#1585;&#1583;&#1610; &#1608; &#1575;&#1604;&#1583;&#1593;&#1605; &#1575;&#1604;&#1605;&#1602;&#1583;&#1605; &#1605;&#1606; &#1589;&#1575;&#1606;&#1593;&#1610; &#1575;&#1604;&#1602;&#1585;&#1575;&#1585;&#1575;&#1578;  <br>
<h4>Example: </h4>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <font size=2> &#1608; &#1605;&#1579;&#1604; &#1607;&#1584;&#1607; &#1575;&#1604;&#1592;&#1585;&#1608;&#1601; &#1602;&#1583; &#1578;&#1601;&#1590;&#1610; &#1601;&#1608;&#1585;&#1575; &#1573;&#1604;&#1609; &#1575;&#1606;&#1583;&#1604;&#1575;&#1593; &#1575;&#1604;&#1571;&#1593;&#1605;&#1575;&#1604; &#1575;&#1604;&#1593;&#1583;&#1575;&#1574;&#1610;&#1577; .</font><br><br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>A0</b>: &#1605;&#1579;&#1604; &#1607;&#1584;&#1607; &#1575;&#1604;&#1592;&#1585;&#1608;&#1601;  <br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>AM-MOD</b>: &#1602;&#1583;  <br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>Rel</b>: &#1578;&#1601;&#1590;&#1610;<br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>AM-TMP</b>: &#1601;&#1608;&#1585;&#1575;  <br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>A2</b>: &#1573;&#1604;&#1609; &#1575;&#1606;&#1583;&#1604;&#1575;&#1593; &#1575;&#1604;&#1571;&#1593;&#1605;&#1575;&#1604; &#1575;&#1604;&#1593;&#1583;&#1575;&#1574;&#1610;&#1577;  <br>
<h4>Example: </h4>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <font size=2> &#1608; &#1607;&#1584;&#1607; &#1575;&#1604;&#1578;&#1583;&#1575;&#1576;&#1610;&#1585; &#1605;&#1606; &#1588;&#1571;&#1606;&#1607;&#1575; &#1571;&#1606; &#1578;&#1601;&#1590;&#1610; &#1601;&#1610; &#1575;&#1604;&#1571;&#1580;&#1604; &#1575;&#1604;&#1591;&#1608;&#1610;&#1604; &#1573;&#1604;&#1609; &#1578;&#1605;&#1578;&#1593; &#1575;&#1604;&#1605;&#1585;&#1571;&#1577; &#1576;&#1605;&#1586;&#1610;&#1583; &#1605;&#1606; &#1575;&#1604;&#1581;&#1602;&#1608;&#1602; .</font><br><br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>A0</b>: &#1607;&#1584;&#1607; &#1575;&#1604;&#1578;&#1583;&#1575;&#1576;&#1610;&#1585; &#1605;&#1606; &#1588;&#1571;&#1606;&#1607;&#1575; &#1571;&#1606;  <br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>Rel</b>: &#1578;&#1601;&#1590;&#1610;<br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>AM-TMP</b>: &#1601;&#1610; &#1575;&#1604;&#1571;&#1580;&#1604; &#1575;&#1604;&#1591;&#1608;&#1610;&#1604;  <br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>A2</b>: &#1573;&#1604;&#1609; &#1578;&#1605;&#1578;&#1593; &#1575;&#1604;&#1605;&#1585;&#1571;&#1577; &#1576;&#1605;&#1586;&#1610;&#1583; &#1605;&#1606; &#1575;&#1604;&#1581;&#1602;&#1608;&#1602;  <br>
<h4>Example: </h4>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <font size=2> &#1608; &#1610;&#1572;&#1605;&#1604; &#1601;&#1610; &#1571;&#1606; &#1610;&#1601;&#1590;&#1610; &#1584;&#1604;&#1603; &#1573;&#1604;&#1609; &#1608;&#1590;&#1593; &#1575;&#1604;&#1605;&#1588;&#1575;&#1585;&#1610;&#1593; &#1584;&#1575;&#1578; &#1575;&#1604;&#1589;&#1604;&#1577; .</font><br><br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>AM-MOD</b>: &#1571;&#1606;  <br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>Rel</b>: &#1610;&#1601;&#1590;&#1610;<br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>A0</b>: &#1584;&#1604;&#1603;  <br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>A2</b>: &#1573;&#1604;&#1609; &#1608;&#1590;&#1593; &#1575;&#1604;&#1605;&#1588;&#1575;&#1585;&#1610;&#1593; &#1584;&#1575;&#1578; &#1575;&#1604;&#1589;&#1604;&#1577;  <br>