<center><h2>Predicate: <font color=red><i>&#1603;&#1588;&#1601;</i></font></h2></center>

<h4>Roleset id: <font color=green>&#1603;&#1588;&#1601;.01</font>, reveal, say something that used to be not known,   show <font color=purple>Source: </font>[reveal.01]</h4>

<h4>Roles:</h4>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>A0</b>: <i>speaker, revealer</i><br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>A1</b>: <i>utterance, truth condition</i><br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>A2</b>: <i>hearer</i><br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>A3</b>: <i>attribute of arg1</i><br>
<h4>Example: </h4>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <font size=2> &#1608; &#1604;&#1603;&#1606; &#1575;&#1604;&#1580;&#1583;&#1608;&#1604; &#1610;&#1603;&#1588;&#1601; &#1571;&#1610;&#1590;&#1575; &#1593;&#1606; &#1580;&#1587;&#1575;&#1605;&#1577; &#1576;&#1593;&#1590; &#1575;&#1604;&#1578;&#1581;&#1583;&#1610;&#1575;&#1578; &#1575;&#1604;&#1578;&#1610; &#1604;&#1575; &#1578;&#1586;&#1575;&#1604; &#1602;&#1575;&#1574;&#1605;&#1577; .</font><br><br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>AM-DIS</b>: &#1608; &#1604;&#1603;&#1606; &#1575;&#1604;&#1580;&#1583;&#1608;&#1604; .  <br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>A0</b>: &#1575;&#1604;&#1580;&#1583;&#1608;&#1604;  <br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>Rel</b>: &#1610;&#1603;&#1588;&#1601;<br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>AM-ADV</b>: &#1571;&#1610;&#1590;&#1575;  <br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>A1</b>: &#1593;&#1606; &#1580;&#1587;&#1575;&#1605;&#1577; &#1576;&#1593;&#1590; &#1575;&#1604;&#1578;&#1581;&#1583;&#1610;&#1575;&#1578; &#1575;&#1604;&#1578;&#1610; &#1604;&#1575; &#1578;&#1586;&#1575;&#1604; &#1602;&#1575;&#1574;&#1605;&#1577;  <br>
<h4>Example: </h4>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <font size=2> &#1608;&#1604;&#1604; &#1571;&#1587;&#1601; , &#1601;&#1573;&#1606; &#1575;&#1604;&#1583;&#1585;&#1608;&#1587; &#1575;&#1604;&#1578;&#1610; &#1575;&#1587;&#1578;&#1601;&#1583;&#1606;&#1575;&#1607;&#1575; &#1605;&#1606; &#1575;&#1604;&#1605;&#1575;&#1590;&#1610; &#1604;&#1575; &#1578;&#1603;&#1588;&#1601; &#1578;&#1604;&#1603; &#1575;&#1604;&#1581;&#1602;&#1610;&#1602;&#1577; &#1575;&#1604;&#1605;&#1579;&#1575;&#1604;&#1610;&#1577; .</font><br><br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>AM-ADV</b>: &#1571;&#1587;&#1601;  <br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>A0</b>: &#1575;&#1587;&#1578;&#1601;&#1583;&#1606;&#1575;&#1607;&#1575; &#1605;&#1606; &#1575;&#1604;&#1605;&#1575;&#1590;&#1610;  <br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>AM-NEG</b>: &#1604;&#1575;  <br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>Rel</b>: &#1578;&#1603;&#1588;&#1601;<br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>A1</b>: &#1578;&#1604;&#1603; &#1575;&#1604;&#1581;&#1602;&#1610;&#1602;&#1577; &#1575;&#1604;&#1605;&#1579;&#1575;&#1604;&#1610;&#1577;  <br>
<h4>Example: </h4>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <font size=2> &#1603;&#1605;&#1575; &#1578;&#1603;&#1588;&#1601; &#1607;&#1584;&#1607; &#1575;&#1604;&#1606;&#1578;&#1575;&#1574;&#1580; &#1593;&#1606; &#1575;&#1604;&#1593;&#1608;&#1575;&#1605;&#1604; &#1575;&#1604;&#1578;&#1610; &#1578;&#1593;&#1585;&#1602;&#1604; &#1607;&#1584;&#1575; &#1575;&#1604;&#1578;&#1601;&#1575;&#1593;&#1604; .</font><br><br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>AM-ADV</b>: &#1603;&#1605;&#1575;  <br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>Rel</b>: &#1578;&#1603;&#1588;&#1601;<br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>A0</b>: &#1607;&#1584;&#1607; &#1575;&#1604;&#1606;&#1578;&#1575;&#1574;&#1580;  <br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>A1</b>: &#1593;&#1606; &#1575;&#1604;&#1593;&#1608;&#1575;&#1605;&#1604; &#1575;&#1604;&#1578;&#1610; &#1578;&#1593;&#1585;&#1602;&#1604; &#1607;&#1584;&#1575; &#1575;&#1604;&#1578;&#1601;&#1575;&#1593;&#1604;  <br>
<h4>Example: </h4>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <font size=2> &#1608;&#1605;&#1593; &#1584;&#1604;&#1603; &#1578;&#1603;&#1588;&#1601; &#1575;&#1604;&#1606;&#1592;&#1585;&#1577; &#1575;&#1604;&#1579;&#1575;&#1602;&#1576;&#1577; &#1593;&#1606; &#1571;&#1606; &#1607;&#1606;&#1575;&#1603; &#1581;&#1575;&#1580;&#1577; &#1573;&#1604;&#1609; &#1575;&#1578;&#1582;&#1575;&#1584; &#1578;&#1583;&#1575;&#1576;&#1610;&#1585; &#1571;&#1603;&#1579;&#1585; &#1580;&#1585;&#1571;&#1577; &#1604;&#1604; &#1602;&#1590;&#1575;&#1569; &#1593;&#1604;&#1609; &#1578;&#1604;&#1603; &#1575;&#1604;&#1605;&#1588;&#1603;&#1604;&#1577; .</font><br><br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>AM-DIS</b>: &#1608;&#1605;&#1593; &#1584;&#1604;&#1603;  <br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>Rel</b>: &#1578;&#1603;&#1588;&#1601;<br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>A0</b>: &#1575;&#1604;&#1606;&#1592;&#1585;&#1577; &#1575;&#1604;&#1579;&#1575;&#1602;&#1576;&#1577;  <br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>A1</b>: &#1607;&#1606;&#1575;&#1603; &#1581;&#1575;&#1580;&#1577; &#1573;&#1604;&#1609; &#1575;&#1578;&#1582;&#1575;&#1584; &#1578;&#1583;&#1575;&#1576;&#1610;&#1585; &#1571;&#1603;&#1579;&#1585; &#1580;&#1585;&#1571;&#1577; &#1604;&#1604; &#1602;&#1590;&#1575;&#1569; &#1593;&#1604;&#1609; &#1578;&#1604;&#1603; &#1575;&#1604;&#1605;&#1588;&#1603;&#1604;&#1577;  <br><center><h2>Predicate: <font color=red><i>&#1603;&#1588;&#1601;</i></font></h2></center>

<h4>Roleset id: <font color=green>&#1603;&#1588;&#1601;.02</font>, detect, find, notice <font color=purple>Source: </font>[detect.01]</h4>

<h4>Roles:</h4>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>A0</b>: <i>detector</i><br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>A1</b>: <i>detected</i><br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>A2</b>: <i>instrument, if separate from arg0</i><br>
<h4>Example: </h4>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <font size=2> &#1608;&#1605;&#1593; &#1584;&#1604;&#1603; , &#1604;&#1605; &#1610;&#1603;&#1578;&#1588;&#1601; &#1601;&#1585;&#1610;&#1602; &#1575;&#1604;&#1578;&#1581;&#1602;&#1602; &#1571;&#1610; &#1588;&#1608;&#1575;&#1607;&#1583; &#1578;&#1583;&#1604; &#1593;&#1604;&#1609; &#1608; &#1580;&#1608;&#1583; &#1576;&#1606;&#1575;&#1569; &#1587;&#1575;&#1576;&#1602; &#1601;&#1610; &#1607;&#1584;&#1575; &#1575;&#1604;&#1605;&#1608;&#1602;&#1593; .</font><br><br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>AM-DIS</b>: &#1608;&#1605;&#1593; &#1584;&#1604;&#1603;  <br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>AM-NEG</b>: &#1604;&#1605;  <br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>Rel</b>: &#1610;&#1603;&#1578;&#1588;&#1601;<br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>A0</b>: &#1601;&#1585;&#1610;&#1602; &#1575;&#1604;&#1578;&#1581;&#1602;&#1602; &#1571;&#1610;  <br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>A1</b>: &#1588;&#1608;&#1575;&#1607;&#1583; &#1578;&#1583;&#1604; &#1593;&#1604;&#1609; &#1608; &#1580;&#1608;&#1583; &#1576;&#1606;&#1575;&#1569; &#1587;&#1575;&#1576;&#1602; &#1601;&#1610; &#1607;&#1584;&#1575; &#1575;&#1604;&#1605;&#1608;&#1602;&#1593;  <br>
<h4>Example: </h4>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <font size=2> &#1608; &#1587;&#1610;&#1603;&#1608;&#1606; &#1576;&#1608;&#1587;&#1593;&#1607; &#1571;&#1606; &#1610;&#1603;&#1588;&#1601; &#1593;&#1606; &#1575;&#1604;&#1578;&#1601;&#1580;&#1610;&#1585;&#1575;&#1578; &#1575;&#1604;&#1606;&#1608;&#1608;&#1610;&#1577; &#1575;&#1604;&#1578;&#1610; &#1578;&#1580;&#1585;&#1609; &#1578;&#1581;&#1578; &#1575;&#1604;&#1571;&#1585;&#1590; , &#1608;&#1601;&#1610; &#1575;&#1604;&#1605;&#1575;&#1569; &#1608;&#1601;&#1610; &#1575;&#1604;&#1594;&#1604;&#1575;&#1601; &#1575;&#1604;&#1580;&#1608;&#1610; .</font><br><br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>A0</b>: &#1587;&#1610;&#1603;&#1608;&#1606; &#1576;&#1608;&#1587;&#1593;&#1607; &#1571;&#1606;  <br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>Rel</b>: &#1610;&#1603;&#1588;&#1601;<br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>A1</b>: &#1593;&#1606; &#1575;&#1604;&#1578;&#1601;&#1580;&#1610;&#1585;&#1575;&#1578; &#1575;&#1604;&#1606;&#1608;&#1608;&#1610;&#1577; &#1575;&#1604;&#1578;&#1610; &#1578;&#1580;&#1585;&#1609; &#1578;&#1581;&#1578; &#1575;&#1604;&#1571;&#1585;&#1590;  <br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>AM-LOC</b>: &#1608;&#1601;&#1610; &#1575;&#1604;&#1605;&#1575;&#1569; &#1608;&#1601;&#1610; &#1575;&#1604;&#1594;&#1604;&#1575;&#1601; &#1575;&#1604;&#1580;&#1608;&#1610;  <br>
<h4>Example: </h4>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <font size=2> &#1608; &#1604;&#1603;&#1606; &#1604;&#1605; &#1610;&#1603;&#1588;&#1601; &#1575;&#1604;&#1606;&#1592;&#1575;&#1605; &#1581;&#1578;&#1609; &#1575;&#1604;&#1570;&#1606; &#1593;&#1606; &#1575;&#1587;&#1605; &#1571;&#1610; &#1605;&#1606; &#1607;&#1572;&#1604;&#1575;&#1569; &#1575;&#1604;&#1571;&#1601;&#1585;&#1575;&#1583; .</font><br><br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>AM-DIS</b>: &#1608; &#1604;&#1603;&#1606;  <br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>AM-NEG</b>: &#1604;&#1605;  <br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>Rel</b>: &#1610;&#1603;&#1588;&#1601;<br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>A0</b>: &#1575;&#1604;&#1606;&#1592;&#1575;&#1605;  <br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>AM-TMP</b>: &#1581;&#1578;&#1609; &#1575;&#1604;&#1570;&#1606;  <br>
<h4>Example: </h4>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <font size=2> &#1608; &#1575;&#1603;&#1578;&#1588;&#1601;&#1578; &#1575;&#1604;&#1573;&#1589;&#1575;&#1576;&#1577; &#1576;&#1578;&#1608;&#1602;&#1601; &#1575;&#1604;&#1606;&#1605;&#1608; &#1608; &#1576;&#1606;&#1602;&#1589; &#1575;&#1604;&#1608;&#1586;&#1606; &#1604;&#1583;&#1609; &#1605;&#1575; &#1610;&#1585;&#1576;&#1608; &#1602;&#1604;&#1610;&#1604;&#1575; &#1593;&#1604;&#1609; 60 &#1601;&#1610; &#1575;&#1604;&#1605;&#1575;&#1574;&#1577; &#1605;&#1606; &#1571;&#1591;&#1601;&#1575;&#1604; &#1575;&#1604;&#1593;&#1610;&#1606;&#1577; .</font><br><br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>Rel</b>: &#1575;&#1603;&#1578;&#1588;&#1601;&#1578;<br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>A0</b>: &#1575;&#1604;&#1573;&#1589;&#1575;&#1576;&#1577;  <br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>A1</b>: &#1576;&#1578;&#1608;&#1602;&#1601; &#1575;&#1604;&#1606;&#1605;&#1608; &#1608; &#1576;&#1606;&#1602;&#1589; &#1575;&#1604;&#1608;&#1586;&#1606;  <br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>AM-LOC</b>: &#1604;&#1583;&#1609; &#1605;&#1575; &#1610;&#1585;&#1576;&#1608; &#1602;&#1604;&#1610;&#1604;&#1575; &#1593;&#1604;&#1609; 60 &#1601;&#1610; &#1575;&#1604;&#1605;&#1575;&#1574;&#1577; &#1605;&#1606; &#1571;&#1591;&#1601;&#1575;&#1604; &#1575;&#1604;&#1593;&#1610;&#1606;&#1577;  <br>