<center><h2>Predicate: <font color=red><i>&#1604;&#1581;&#1592;</i></font></h2></center>

<h4>Roleset id: <font color=green>&#1604;&#1581;&#1592;.01</font>, note, say <font color=purple>Source: </font>[note.01]</h4>

<h4>Roles:</h4>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>A0</b>: <i>noter</i><br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>A1</b>: <i>utterance</i><br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>A2</b>: <i>hearer</i><br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>A3</b>: <i>attribute of arg1</i><br>
<h4>Example: </h4>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <font size=2> &#1608;&#1605;&#1606; &#1575;&#1604;&#1605;&#1588;&#1580;&#1593; &#1571;&#1606; &#1606;&#1604;&#1575;&#1581;&#1592; &#1571;&#1606; 23 &#1576;&#1604;&#1583;&#1575; &#1571;&#1601;&#1585;&#1610;&#1602;&#1610;&#1575; &#1578;&#1578;&#1604;&#1602;&#1609; &#1575;&#1604;&#1570;&#1606; &#1575;&#1604;&#1605;&#1587;&#1575;&#1593;&#1583;&#1577; &#1605;&#1606; &#1575;&#1604;&#1605;&#1576;&#1575;&#1583;&#1585;&#1577; .</font><br><br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>A0</b>: &#1608;&#1605;&#1606; &#1575;&#1604;&#1605;&#1588;&#1580;&#1593; &#1571;&#1606; .  <br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>AM-MOD</b>: &#1575;&#1604;&#1605;&#1588;&#1580;&#1593;  <br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>Rel</b>: &#1606;&#1604;&#1575;&#1581;&#1592;<br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>A1</b>: &#1571;&#1606; 23 &#1576;&#1604;&#1583;&#1575; &#1571;&#1601;&#1585;&#1610;&#1602;&#1610;&#1575; &#1578;&#1578;&#1604;&#1602;&#1609; &#1575;&#1604;&#1570;&#1606; &#1575;&#1604;&#1605;&#1587;&#1575;&#1593;&#1583;&#1577; &#1605;&#1606; &#1575;&#1604;&#1605;&#1576;&#1575;&#1583;&#1585;&#1577;  <br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>AM-TMP</b>: &#1575;&#1604;&#1570;&#1606; &#1575;&#1604;&#1605;&#1587;&#1575;&#1593;&#1583;&#1577;  <br>
<h4>Example: </h4>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <font size=2> &#1603;&#1605;&#1575; &#1578;&#1604;&#1575;&#1581;&#1592; &#1575;&#1604;&#1604;&#1580;&#1606;&#1577; &#1605;&#1593; &#1575;&#1604;&#1602;&#1604;&#1602; &#1593;&#1583;&#1605; &#1608; &#1580;&#1608;&#1583; &#1587;&#1610;&#1575;&#1587;&#1577; &#1588;&#1575;&#1605;&#1604;&#1577; &#1576;&#1588;&#1571;&#1606; &#1575;&#1604;&#1571;&#1591;&#1601;&#1575;&#1604; .</font><br><br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>AM-EXT</b>: &#1603;&#1605;&#1575;  <br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>Rel</b>: &#1578;&#1604;&#1575;&#1581;&#1592;<br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>A0</b>: &#1575;&#1604;&#1604;&#1580;&#1606;&#1577;  <br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>AM-MNR</b>: &#1605;&#1593; &#1575;&#1604;&#1602;&#1604;&#1602;  <br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>A1</b>: &#1593;&#1583;&#1605; &#1608; &#1580;&#1608;&#1583; &#1587;&#1610;&#1575;&#1587;&#1577; &#1588;&#1575;&#1605;&#1604;&#1577; &#1576;&#1588;&#1571;&#1606; &#1575;&#1604;&#1571;&#1591;&#1601;&#1575;&#1604;  <br>
<h4>Example: </h4>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <font size=2> &#1603;&#1605;&#1575; &#1578;&#1604;&#1575;&#1581;&#1592; &#1575;&#1604;&#1604;&#1580;&#1606;&#1577; &#1571;&#1606; &#1580;&#1605;&#1610;&#1593; &#1575;&#1604;&#1602;&#1608;&#1575;&#1578; &#1607;&#1610; &#1581;&#1575;&#1604;&#1610;&#1575; &#1601;&#1610; &#1605;&#1587;&#1585;&#1581; &#1575;&#1604;&#1593;&#1605;&#1604;&#1610;&#1575;&#1578; &#1571;&#1608; &#1601;&#1610; &#1591;&#1585;&#1610;&#1602;&#1607;&#1575; &#1573;&#1604;&#1610;&#1607; .</font><br><br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>AM-DIS</b>: &#1603;&#1605;&#1575;  <br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>Rel</b>: &#1578;&#1604;&#1575;&#1581;&#1592;<br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>A0</b>: &#1575;&#1604;&#1604;&#1580;&#1606;&#1577; &#1571;&#1606;  <br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>A1</b>: &#1580;&#1605;&#1610;&#1593; &#1575;&#1604;&#1602;&#1608;&#1575;&#1578; &#1607;&#1610; &#1581;&#1575;&#1604;&#1610;&#1575; &#1601;&#1610; &#1605;&#1587;&#1585;&#1581; &#1575;&#1604;&#1593;&#1605;&#1604;&#1610;&#1575;&#1578; &#1571;&#1608; &#1601;&#1610; &#1591;&#1585;&#1610;&#1602;&#1607;&#1575; &#1573;&#1604;&#1610;&#1607;  <br>
<h4>Example: </h4>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <font size=2> &#1608; &#1578;&#1604;&#1575;&#1581;&#1592; &#1591;&#1575;&#1580;&#1610;&#1603;&#1587;&#1578;&#1575;&#1606; &#1605;&#1593; &#1575;&#1604;&#1575;&#1585;&#1578;&#1610;&#1575;&#1581; &#1575;&#1604;&#1578;&#1602;&#1583;&#1605; &#1575;&#1604;&#1603;&#1576;&#1610;&#1585; &#1601;&#1610; &#1580;&#1607;&#1608;&#1583; &#1573;&#1606;&#1593;&#1575;&#1588; &#1571;&#1601;&#1594;&#1575;&#1606;&#1587;&#1578;&#1575;&#1606; .</font><br><br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>Rel</b>: &#1578;&#1604;&#1575;&#1581;&#1592;<br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>A0</b>: &#1591;&#1575;&#1580;&#1610;&#1603;&#1587;&#1578;&#1575;&#1606;  <br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>AM-MNR</b>: &#1605;&#1593; &#1575;&#1604;&#1575;&#1585;&#1578;&#1610;&#1575;&#1581;  <br>
&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <b>A1</b>: &#1575;&#1604;&#1578;&#1602;&#1583;&#1605; &#1575;&#1604;&#1603;&#1576;&#1610;&#1585; &#1601;&#1610; &#1580;&#1607;&#1608;&#1583; &#1573;&#1606;&#1593;&#1575;&#1588; &#1571;&#1601;&#1594;&#1575;&#1606;&#1587;&#1578;&#1575;&#1606;  <br>